validationTestCases/WFDS-canopy/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue Cd 0
    volScalarFieldValue LAD 0
);

regions
(

	// canopy region
	boxToCell
    {
        box (50 0 0) (1050 150 18);
        fieldValues
        (
            volScalarFieldValue Cd 0.25
            volScalarFieldValue LAD 0.15    // average value, also the max value, of the profile shown in the paper
        );
    }

);


// ************************************************************************* //
